# FPatByClass

## Description
Sets the default document fill pattern to the fill pattern of the active class.

```pascal
PROCEDURE FPatByClass;
```

```python
def vs.FPatByClass():
    return None
```

## Remarks
Sets the global attributes to use the fill pattern of the default class.

## Examples
```pascal
FPatByClass;
```
```python
vs.FillColorByClass()
vs.PenColorByClass()
vs.MarkerByClass()
vs.FPatByClass()
vs.LSByClass()
vs.LWByClass()
```

## See Also
VS Functions:
PenColorByClass
| MarkerByClass
| FillColorByClass

## Version
Availability: from VectorWorks8.0

## Category
* Classes